Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/rights_of_same_sex_couples.html.txt.tmx
Source language: en
Languages: ga

source: Rights of same-sex couples
ga: Na cearta atá ag lánúineacha den ghnéas céanna

source: • Cohabitants • EU citizens and their family members
ga: • Saoránaigh AE agus a mbaill teaghlaigh

source: In many European countries, legal recognition has been given to same-sex partnerships to varying degrees
ga: In go leor tíortha Eorpacha, tugadh aitheantas dlíthiúil de mhéideanna éagsúla do pháirtnéireachtaí comhghnéis

source: In 2011 a statutory civil partnership registration scheme for same-sex couples was introduced in Ireland
ga: In 2011, tugadh scéim chlárúcháin páirtnéireachta sibhialta isteach le haghaidh lánúineacha comhghnéis in Éirinn

source: Following a vote in favour of marriage equality in a constitutional referendum, the right for same-sex couples to marry was introduced in November 2015
ga: I ndiaidh vóta i bhfabhar comhionannas pósta i reifreann bunreachtúil, tugadh an ceart isteach gur féidir le lánúineacha comhghnéis pósadh i Samhain 2015

source: Under the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 a statutory civil partnership registration scheme for same-sex couples was introduced in January 2011
ga: Faoin Acht um Páirtnéireacht Shibhialta agus Cearta agus Oibleagáidí Áirithe Comháitritheoirí, 2010, tugadh isteach scéim chlárúcháin páirtnéireachta sibhialta reachtúil in Eanáir 2011

source: Under the scheme registered civil partners have broadly the same rights and obligations towards each other as the rights and obligations of married couples towards each
ga: Faoin scéim, tá na cearta agus oibleagáidí céanna, den chuid is mó, ag páirtnéirí sibhialta cláraithe dá chéile agus atá ag lánúineacha pósta dá chéile

source: Since 16 November 2015, no new civil partnerships can be registered unless the couple have notified the registrar of their intention to enter a civil partnership before that date
ga: Ón 16 Samhain 2015 ar aghaidh, ní féidir aon pháirtnéireachtaí nua sibhialta a chlárú murar thug an lánúin fógra don chláraitheoir go bhfuil sé beartaithe acu páirtnéireacht shibhialta a iontráil roimh an dáta sin

source: More information is available in our document: Civil partnership and same-sex couples
ga: Tá níos mó faisnéise ar fáil inár gcáipéis: Páirtnéireacht shibhialta agus lánúineacha comhghnéis

source: Since 16 November 2015, it is possible for same-sex couples to become legally married and to have the same rights and obligations towards each other as opposite-sex married couples
ga: Ón 16 Samhain 2015, is féidir le lánúineacha comhghnéis a bheith pósta go dlíthiúil agus na cearta céanna agus na hoibleagáidí a bheith acu dá chéile a bhíonn ag lánúineacha pósta den ghnéas eile

source: It is also possible for a couple in a civil partnership to marry
ga: Chomh maith leis sin, is féidir le lánúin i bpáirtnéireacht shibhialta pósadh

source: More information is available in our document on getting married
ga: Tá níos mó faisnéise ar fáil inár gcáipéis ar phósadh

source: Under the 2010 Act cohabitants are defined as two same-sex or opposite-sex adults who are:
ga: Faoi Acht 2010, is é an sainmhíniú a thugtar ar chomhchónaitheoirí ná beirt daoine fásta den ghnéas céanna nó den ghnéas eile:

source: • Not married to each other or in a registered civil partnership
ga: • Nach bhfuil pósta lena chéile nó i bpáirtnéireacht shibhialta chláraithe

source: • Not related within the prohibited degrees of relationship (broadly speaking, relationships which would make them ineligible to marry each other)
ga: • Nach bhfuil gaolta laistigh laistigh de na céimeanna cosctha de chaidreamh (go ginearálta, caidrimh a dhícháileodh iad óna chéile a phósadh)

source: • Living together in an intimate and committed relationship
ga: • Atá ina gcónaí lena chéile i gcaidreamh tiomanta agus dlúth

source: The Act amended a number of laws where rights are already available to opposite-sex cohabitants in order to make such rights available to same-sex cohabitants
ga: Leasaigh an tAcht roinnt dlíthe a raibh cearta ar fáil cheana do chomhchónaitheoirí ar ghnéis dhifriúla iad chun na cearta céanna a bheith ar fáil do chomhchónaitheoirí comhghnéis

source: • The Residential Tenancies Act 2004 was amended to provide that a same-sex cohabitant of a deceased tenant has the same entitlement to inherit a tenancy as an opposite-sex cohabitant of a deceased tenant has
ga: • Leasaíodh An tAcht um Thionóntachtaí Cónaithe 2004 chun soláthar go raibh an teidlíocht chéanna ag comhchónaitheoir comhghnéis de thionónta básaithe chun teacht in oidhreacht ar thionónacht agus atá ag comhchónaitheoir ar ghnéas difriúil é

source: • The Civil Liability Act 1961 now provides that a same-sex cohabitant of a deceased person has the same entitlement that an opposite-sex cohabitant has to sue for damages in the event of the cohabitant’s wrongful death
ga: • Soláthraíonn an tAcht um Dhliteanas Sibhialta, 1961 go bhfuil an teidlíocht chéanna anois ag comhchónaitheoir comhghnéis de dhuine básaithe agus atá ag comhchónaitheoir ar ghnéas difriúil agair do dhamáistí i gcás bhás éagórach an chomhchónaitheora

source: • Qualified cohabitants as defined in the 2010 Act (see below) are now entitled to be informed about the registration of an enduring power of attorney under the Powers of Attorney Act 1996
ga: • Tá teidlíocht anois ag comhchónaitheoirí cáilithe arna shainmhíniú san Acht (féach thíos) a bheith curtha ar an eolas faoi chlárú chumhacht aturnae sheasmhach faoin Acht um Chumhacht Aturnae 1996

source: The Act also introduced a redress scheme for cohabiting couples including same-sex cohabiting couples
ga: Thug an tAcht isteach scéim chúitimh do lánúineacha comhchónaithe chomh maith, ina n-áirítear lánúineacha comhghnéis

source: To be a a qualified cohabitant for the scheme you must have been a cohabitant for at least 5 years or for 2 years if you have a child with your partner
ga: Chun a bheith i do chomhchónaitheoir cáilithe don scéim, caithfidh go raibh tú i do chomhchónaitheoir do ar a laghad 5 bliana nó do 2 bhliain má tá leanbh agat le do pháirtnéir

source: If one of you is still married, then neither of you may be a qualified cohabitant until the married person has been living apart from his/her spouse for at least 4 of the previous 5 years
ga: Má tá duine agaibh pósta fós, d’fhéadfaí nach bhfuil ceachtar agaibh ina gcomhchónaitheoir cáilithe go dtí go bhfuil an duine pósta ag cónaí óna chéile óna chéile do ar a laghad 4 bliana as na 5 bliana roimhe seo

source: Tax and social welfare
ga: Cáin agus leasa shóisialaigh

source: Cohabiting couples (whether same sex or opposite sex) are not treated in the same way as married couples or civil partners for tax purposes
ga: Ní chaitear le lánúineacha comhchónaithe (comhghnéis nó ar ghnéis dhifriúla) ar an gcaoi chéanna le lánúineacha pósta nó páirtneirí sibhialta do chuspóirí cánacha

source: Cohabiting opposite-sex couples were already treated in the same way as married couples in the social welfare system
ga: Caitheadh le lánúineacha comhchónaithe ar ghnéis dhifriúla ar an gcaoi chéanna le lánúineacha phósta sa chóras leasa shóisialaigh

source: Since 1 January 2010 cohabiting same-sex couples are treated the same as cohabiting opposite-sex couples
ga: Ó 1 Eanair 2011, caitear le lánúineacha comhchónaithe comhghnéis ar an gcaoi chéanna le lánúineacha comhchónaithe ar ghnéis dhifriúla

source: This follows changes introduced by the Social Welfare and Pensions Act 2010
ga: Leanann sé seo athruithe ar thug an tAcht um Leasa Shóisialaigh agus Pinsin 2010 isteach

source: This means that one of the cohabitants will be treated as an adult dependant when the other cohabitant makes a claim for a social welfare payment
ga: Ciallaíonn sé seo go gcaithfear le duine de na comhchónaitheoirí mar chleithiúnach aosach nuair a dhéanann an comhchónaitheoir eile éileamh ar íocaíocht leasa shóisialaigh

source: EU citizens and their family members
ga: Saoránaigh AE agus a mbaill teaghlaigh

source: The European Communities (Free Movement of Persons) Regulations 2015 transpose EU Directive 2004/38/EC into Irish law
ga: Trasdulann Rialacháin na gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015 an Treoir AE 2004/38/EC isteach i ndlí na hÉireann

source: The Regulations provide for the facilitation of entry and residence for EU citizens and their family members
ga: Soláthraíonn na Rialacháin d’éascú iontrála agus cónaithe do shaoránaigh AE agus a mbaill teaghlaigh

source: The Regulations also provide for a wider definition of "family member" , to include a partner with whom the EU citizen has a durable relationship, duly attested, and the dependent parents, children under 21 and other dependent children of that partner
ga: Soláthraíonn na Rialacháin freisin do shainmhíniú níos leithne ar “bhall teaghlaigh” chun páirtnéir a bhfuil caidreamh buan ag an saoránach AE leis a áireamh, arna dhearbhú go cuí, agus tuismitheoirí cleithiúnacha, leanaí faoi 21 agus leanaí cleithiúnacha eile an pháirtnéara

source: This does not involve the recognition of such partnerships for other purposes
ga: Ní áiríonn sé seo aitheantas dá leithéid de pháirtnéireachtaí do chuspóirí eile

source: Read more about residence rights for family members here
ga: Léigh tuilleadh faoi chearta cónaithe do bhaill teaghlaigh anseo
